content/en/post/Musca-Algo-Notes-Preview.md
---
title: "Musca's Algo Notes: Preview"
author: ["Muscaestar"]
date: 2020-02-13T20:56:00+11:00
lastmod: 2020-02-13T21:10:19+11:00
tags: ["Algorithm"]
draft: false
---

Algorithms, the field which is so fundamental, so important, and so hard,
relatively speaking. For a student without any working experience, algorithm should
be:

1.  A proof of your solid knowledge base
2.  A guide to help you truly understand some classic source code
3.  An inspirer, connecting the tech world with reality

I'll keep updating this post, listing key terms in Algorithm field. The list can
also be regarded as my study path. I'll try to write blogs for every term mentioned.

<!--more-->


## Basic Terminology {#basic-terminology}

-   Asymptotic complexity analysis - 渐进式复杂度分析
    -   Big O notation(asymptotic notation) - 大 O 符号（渐进符号）
-   Recursion - 递归
-   Sorting - 排序
-   Searching - 搜索
-   Set - 集合
-   Tree - 树
-   Graph - 图
-   Greedy - 贪心
-   Divide and conquer - 分治
-   Backtracking algorithm - 回溯
-   Dynamic programming - 动态规划
-   BitMap - 位图


## Data Structure {#data-structure}

-   Array - 数组
-   List - 列表
-   Linked list - 链表
    -   Singly linked list - 单链表
    -   Doubly linked list - 双向链表
    -   Circular linked list - 循环链表
-   Stack - 栈
-   Queue - 队列
    -   Array-implementation queue - 顺序队列
    -   Linked-list implementation queue - 链式队列
    -   Double-ended queue - 双端队列
    -   Circular buffer(circular queue) - 循环队列
    -   Blocking queue - 阻塞队列
    -   Concurrent queue - 并发队列
-   Priority queue - 优先队列
    -   Double-ended priority queue - 双端优先队列
-   Hash table - 散列表、哈希表
-   Binary tree - 二叉树
    -   BST(Binary search tree) - 二叉查找树
    -   Self-balancing (or height-balanced) binary search tree - 平衡二叉查找树
    -   Red-black tree - 红黑树
    -   AVL Tree - AVL 树
-   Recursion Tree - 递归树
-   Heap - 堆
-   B+ Tree - B＋树
-   Skip list - 跳表


## Algorithm {#algorithm}


### Sorting algorithms - 排序算法 {#sorting-algorithms-排序算法}

-   Bubble sort - 冒泡排序
-   Insertion sort - 插入排序
-   Shell sort - 希尔排序
-   Selection sort - 选择排序
-   Merge sort - 归并排序
-   Quick sort(partition-exchange sort) - 快速排序
-   Bucket sort - 桶排序
-   Counting sort - 计数排序
-   Radix sort - 基数排序
-   Heap sort - 堆排序
-   Topological sort - 拓扑排序


### String-matching algorithms - 字符串匹配算法 {#string-matching-algorithms-字符串匹配算法}

-   Brute Force - 暴力匹配算法、BF 算法
-   Rabin-Karp Algorithm - RK（Rabi Karp) 算法
-   Boyer-Moore Algorithm - BM（Boye Moore）算法
-   KMP(Knuth–Morris–Pratt) Algorithm - KMP 算法
-   Trie Tree - Trie 树、字典树
-   Aho–Corasick Algorithm - AC 自动机算法


### Searching - 搜索 {#searching-搜索}

-   Binary search - 二分查找
-   DFS(Depth-First search) - 深度优先搜索
-   BFS(Breadth-first search) - 广度优先搜索
-   Dijkstra Algorithm - Dijkstra 算法
-   A\* search algorithm - A\*算法


### Hash algorithms - 哈希算法、散列算法 {#hash-algorithms-哈希算法-散列算法}


## The End {#the-end}

Plan:

-   [ ] Implementation of Binary Tree, pre/in/post-order traversal; BST
    Implementation, insert/find/delete;find last/next/largest/smallest nodes

-   [ ] Keep updating...


## Reference {#reference}

-   [极客时间－数据结构与算法之美](https://time.geekbang.org/column/intro/126)
-   [Cormen and Balkcom's Algorithms course](https://www.khanacademy.org/computing/computer-science/algorithms)
-   Wikipedia
